trade_exp/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Сотрудники</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b57ce5b7-9e28-4f84-a668-467a507068c3">
    <name>Должность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="613a9982-ea2e-40bd-b0e1-5642e976be87">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c97fb60c-ec2d-420a-93a9-39602a2bbfdf">
    <name>Уволен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18560314-7951-472c-8aac-2a5b52d0acfe">
    <name>Отдел</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf0376ac-0d78-4ccb-88b0-6fb290797677">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aa27d4c3-5c6c-4d49-bc20-f0d9faedd48f">
    <name>РольОПШ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f20e46f-464f-4f7c-85f2-c2ceb761c7ca">
    <name>ДатаУвольнения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea584be0-70fa-40c6-9056-0ac6d48f5544">
    <name>ДатаПриема</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="93190e85-82b5-4f8d-86d4-60a3ed158497">
    <name>ИзменятьТребуетПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ae0a6a00-9b29-4553-88a2-43a85bee5a3a">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2c716114-b753-459f-820d-3eefc10412b6">
    <name>ИдентификаторМобильногоПриложения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0e3a882-dc26-453d-ae18-394afecbe606">
    <name>ЦельПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e140be66-a953-4235-9404-eb1e4326c329">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e204e166-c00a-4107-b2f6-e178a0260ea2">
    <name>ПотребностьВСлужебномТранспорте</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e321359-c912-4451-9965-e660dd87561c">
    <name>ВГрафике</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="75ed98aa-60db-49f8-9e60-419549eea6b0">
    <name>Касса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="81ba44aa-675f-4a78-bd9e-bd949a5d139f">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c56826a-54b5-44f6-b674-4f57e9006ae4">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c365c143-4ee2-4da0-840a-f5707c956f21">
    <name>ИзменятьЦель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1bad7ab2-c198-4c43-a6cd-a4c4dcb497cf">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="824f90f8-db60-4eee-ae25-c8da8bd31141">
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="46ca7a78-d4ae-44ee-8d05-a15add9f79c4">
    <name>ПутьДляФотоСТСД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7b035ccb-950d-48ec-ba42-fbcf94fe0d51">
    <name>УстанавливатьПериодНеПозднее</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7162254b-c2fe-4139-94ea-cc0f720a9b3d">
    <name>ИзменятьТипПропуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="961c74cb-fce1-43c3-af7f-b67d404817cb">
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6667f724-4527-4af9-9d26-f2ced65f4ed5">
    <name>ВыгружатьНаСайт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e43fec11-e2d6-4ba1-935e-cfc4047484d6">
    <name>Индивидуально</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="35688e1d-3d5d-4ba4-a2d2-a8ae02028ceb">
    <name>УровеньДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9dfb1156-61b0-4cf6-a749-49cf491b66af">
    <name>ЗапретитьСоздаватьПропуск</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="662ef78d-bb7a-4142-8543-46c55d375e3a">
    <name>ИзменятьПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0983b722-4b9b-4508-9502-eadb41d5ef36">
    <name>ТабельныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="25fb4b64-3389-40d8-a0fb-1a48696c5f69">
    <name>ДатаПеревода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="de354010-7d67-44cf-87d4-e48af516a477">
    <name>РольМобильногоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6020fb7b-5fb1-4cf3-a1df-ee412178682d">
    <name>ДолжностьЗУП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="44079ee7-c820-4e7e-90b6-b558be1c261a">
    <name>ПодразделениеЗУП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ae05a309-265f-484f-b720-0b93517910b0">
    <name>ОповещенияИзОчереди</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6d6189b4-cd43-4428-b345-8c04fb2cba4c">
    <name>ВышестоящееПодразделениеЗУП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="df0fd9e1-cd5c-4ecd-9102-493f1dbba937">
    <name>ВнутреннийТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41e900a7-c10f-4f56-bc62-69d7108bc92e">
    <name>КорпоративныйТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1973c897-b5f8-4020-b1e7-47881040abeb">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0fdb6ac0-b230-43d6-b6e7-bd153e64f5a0">
    <name>Удаленщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7fb666be-2e07-4d2e-8843-dcec84180a27">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d44aa133-8703-4fc0-b5ff-67b13c6f1ea4">
    <name>ДопУтверждениеББ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="57989287-32be-4a51-8f5a-0c9a27b45041">
    <name>ПравоНаПроверку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0150eb34-5757-4b0a-b42e-18cb40c1f263">
    <name>ПравоНаСогласование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba7e389d-4b02-43cb-9a13-1b3a0f9a4be1">
    <name>Аутсорс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="de79966c-ad14-441f-95c9-e94a04bef8bc">
    <name>СписокЗон</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a6561ebb-def2-4423-834a-41631f1b243a">
      <name>ЗонаДоступа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="aff5c93c-abdd-44ce-86ba-3df5ea78303d">
    <name>РабочиеУчастки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e6045355-ff14-41a0-a6e6-dba35c5249a7">
      <name>РабочийУчасток</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e6b14f6a-ed6b-424d-92dd-c34e7f8b22e6">
    <name>БейджыВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d1e828b1-f591-4c25-9e7e-aeef3e67afb2">
      <name>ТранспортноеСредство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="806f21ff-78a2-4496-90c9-dfd5253a5be0">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>15</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="69aeacfc-4a6b-4d95-9201-ae704bbb53c0">
      <name>Наименование</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>60</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/Сотрудники/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Карточка номенклатуры
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "МакетШтрихкода";
	КомандаПечати.Представление = НСтр("ru = 'Бейджик'");
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Бейджик'");
	
	// Карточка номенклатуры
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "МакетQrкода";
	КомандаПечати.Представление = НСтр("ru = 'Бейджик - QR-код'");
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Бейджик - QR-код''"); 
	
	// Карточка номенклатуры
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "МакетБейджикаВодителя";
	КомандаПечати.Представление = НСтр("ru = 'Бейджики для водителя'");
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Бейджики для водителя''");


КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетШтрихкода") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"МакетШтрихкода", 
		"МакетШтрихкода", 
		СформироватьПечатнуюФормуМакетШтрихкода(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетQrкода") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"МакетQrкода", 
		"МакетQrкода", 
		СформироватьПечатнуюФормуМакетQrкода(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;  
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетБейджикаВодителя") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"МакетБейджикаВодителя", 
		"МакетБейджикаВодителя", 
		СформироватьПечатнуюФормуМакетБейджикаВодителя(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;

	

	
КонецПроцедуры

Функция СформироватьПечатнуюФормуМакетШтрихкода(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	//Ссылка= МассивОбъектов[0].Ссылка;
	
	ТабДок= Новый ТабличныйДокумент;
	Макет= ПолучитьМакет("МакетШтрихкода");
	Шапка= Макет.ПолучитьОбласть("Шапка");
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		Шапка.Параметры.Должность= ВРег(Ссылка.Должность);	
		Шапка.Параметры.Сотрудник= ВРег(Ссылка.Наименование);	
		
		//Штрихкод
		Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
		КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
		
		Рисунок= Шапка.Рисунки[0];
		
		
		ПараметрыШтрихкода = Новый Структура;
		ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(Ссылка.Код));
		ПараметрыШтрихкода.Вставить("ТипКода",         99);
		ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
		ПараметрыШтрихкода.Вставить("РазмерШрифта",    12);
		
		Рисунок.Картинка = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода).Картинка;
		//-	
		
		ТабДок.Вывести(Шапка);
	КонецЦикла;
	Возврат ТабДок;
КонецФункции

Функция СформироватьПечатнуюФормуМакетQrкода(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	//Ссылка= МассивОбъектов[0].Ссылка;
	
	ТабДок= Новый ТабличныйДокумент;
	Макет= ПолучитьМакет("МакетQrкода");
	Шапка= Макет.ПолучитьОбласть("Шапка");
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		Шапка.Параметры.Должность= ВРег(Ссылка.Должность);	
		Шапка.Параметры.Сотрудник= ВРег(Ссылка.Наименование);	
		ТабДок.Вывести(Шапка);

		
		ОбластьQRкода = Макет.ПолучитьОбласть("ОбластьQRкода");;
		ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(СокрЛП(Ссылка.Код), 1, 200);
  		КартинкаQRКода = Новый Картинка(ДанныеQRКода);
 		ОбластьQRкода.Рисунки.QRКод.Картинка = КартинкаQRКода;
		ТабДок.Вывести(ОбластьQRкода);

			КонецЦикла;
	Возврат ТабДок;
КонецФункции            

Функция СформироватьПечатнуюФормуМакетБейджикаВодителя(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	//Ссылка= МассивОбъектов[0].Ссылка;
	
	ТабДок= Новый ТабличныйДокумент;
	Макет= ПолучитьМакет("МакетБейджикаВодителя");
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		Для Каждого Строка Из Ссылка.БейджыВодителя Цикл
			
			Шапка= Макет.ПолучитьОбласть("Шапка");
			Отступ = Макет.ПолучитьОбласть("Отступ"); 
			Шапка.Параметры.Водитель= ВРег(Ссылка.Наименование);	
			Шапка.Параметры.ТранспортноеСредство= ВРег(Строка.ТранспортноеСредство);	
			ТабДок.Вывести(Шапка);

			
			ОбластьQRкода = Макет.ПолучитьОбласть("ОбластьQRкода");;
			ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(СокрЛП(Строка.Штрихкод), 1, 200);
	  		КартинкаQRКода = Новый Картинка(ДанныеQRКода);
	 		ОбластьQRкода.Рисунки.QRКод.Картинка = КартинкаQRКода;
			ТабДок.Вывести(ОбластьQRкода);   
			ТабДок.Вывести(Отступ);
		КонецЦикла; 	

			КонецЦикла;
	Возврат ТабДок;
КонецФункции



Функция ПолучитьВодителяПоИдентификатору(ИдентификаторМобильногоПриложения) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ИдентификаторМобильногоПриложения КАК ИдентификаторМобильногоПриложения,
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ИдентификаторМобильногоПриложения = &ИдентификаторМобильногоПриложения";
	
	Запрос.УстановитьПараметр("ИдентификаторМобильногоПриложения", ИдентификаторМобильногоПриложения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции
#КонецЕсли
